In [1]:
import requests
import pandas as pd
from sqlalchemy import create_engine
import csv
import numpy as np

In [2]:
#reads in the csv
csv_file = "../data/summer.csv"
directory_db = pd.read_csv(csv_file)

directory_db

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold
4,1896,Athens,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver
...,...,...,...,...,...,...,...,...,...
31160,2012,London,Wrestling,Wrestling Freestyle,"JANIKOWSKI, Damian",POL,Men,Wg 84 KG,Bronze
31161,2012,London,Wrestling,Wrestling Freestyle,"REZAEI, Ghasem Gholamreza",IRI,Men,Wg 96 KG,Gold
31162,2012,London,Wrestling,Wrestling Freestyle,"TOTROV, Rustam",RUS,Men,Wg 96 KG,Silver
31163,2012,London,Wrestling,Wrestling Freestyle,"ALEKSANYAN, Artur",ARM,Men,Wg 96 KG,Bronze
31164,2012,London,Wrestling,Wrestling Freestyle,"LIDBERG, Jimmy",SWE,Men,Wg 96 KG,Bronze

In [3]:
#groups country by Country and Year
country_medal_db=directory_db.groupby(['Country','Year']).count()
country_medal_db=country_medal_db[['Medal']]
country_medal_db.reset_index(inplace=True)

#rearranges by year
country_medal_db.sort_values('Year', ascending=True,inplace=True)
country_medal_db.set_index(['Year','Country'],inplace=True)


country_medal_db

              Medal
Year Country
1896 AUT          5
     GBR          7
     GER         33
     DEN          6
     GRE         52
...             ...
2012 GAB          1
     FRA         82
     RUS        130
     GER         94
     QAT          2

[1157 rows x 1 columns]

In [4]:
#calculates Medal accumalitve sum - though I didn't end up using it
country_medal_db['Medal_Sum'] = country_medal_db.groupby('Country').cumsum()
country_medal_db

              Medal  Medal_Sum
Year Country
1896 AUT          5          5
     GBR          7          7
     GER         33         33
     DEN          6          6
     GRE         52         52
...             ...        ...
2012 GAB          1          1
     FRA         82       1396
     RUS        130        768
     GER         94       1305
     QAT          2          4

[1157 rows x 2 columns]

In [60]:
#exports csv
country_medal_db.to_csv('../Data/summer_country_medals.csv',index=True)